Modules/Frontend/Repositories/CategoryRepository.php

select `categories`.`name`, `categories`.`slug` from `categories` inner join `category_positions` on `categories`.`id` = `category_positions`.`category_id` where `parent_id` is null and `is_active` = 1 and `categories`.`deleted_at` is null and `category_positions`.`detail_header_position` is not null order by `category_positions`.`detail_header_position` asc limit 11
---
    public function getDetailPageHeaderCategoriesByPosition($limit = 10)
    {
        return DB::table('categories')
            ->select('categories.name', 'categories.slug')
            ->where('parent_id', null)
            ->where('is_active', true)
            ->whereNull('categories.deleted_at')
            ->join('category_positions', 'categories.id', '=', 'category_positions.category_id')
            ->orderBy('category_positions.detail_header_position', 'ASC')
            ->whereNotNull('category_positions.detail_header_position')
            ->limit($limit)
            ->get();

select `categories`.`name`, `categories`.`slug` from `categories` inner join `category_positions` on `categories`.`id` = `category_positions`.`category_id` where `parent_id` is null and `is_active` = 1 and `category_positions`.`front_header_position` is not null order by `category_positions`.`front_header_position` asc limit 11
---
    public function getFrontPageHeaderCategoriesByPosition($limit = 10)
    {
        return DB::table('categories')
            ->select('categories.name', 'categories.slug')
            ->where('parent_id', null)
            ->where('is_active', true)
            ->join('category_positions', 'categories.id', '=', 'category_positions.category_id')
            ->orderBy('category_positions.front_header_position', 'ASC')
            ->whereNotNull('category_positions.front_header_position')
            ->limit($limit)
            ->get();