Modules/Frontend/Repositories/NewsRepository.php

select `news`.`title`, `news`.`slug`, `news`.`sub_title`, `reporters`.`name` as `reporter_name`, `guests`.`name` as `guest_name`, `categories`.`name` as `categories`, `categories`.`slug` as `category_slug`, `news`.`id` as `image`, `news`.`id` as `image_description` from `news` inner join `news_categories` on `news_categories`.`news_id` = `news`.`id` inner join `categories` on `categories`.`id` = `news_categories`.`category_id` inner join `category_positions` on `categories`.`id` = `category_positions`.`category_id` left join `guests` on `news`.`guest_id` = `guests`.`id` left join `reporters` on `news`.`reporter_id` = `reporters`.`id` where `category_positions`.`front_body_position` = 1 limit 8
---
    public function getNewsByPosition(int $position, int $limit)
    {

        return DB::table('news')
            ->select('news.title', 'news.sub_title', 'news.short_description',
                'categories.name as categories', 'news.id as news_slug',
                'categories.slug as category_slug', 'news.image',
                'news.image_description', 'news.image_alt')
            ->selectRaw('IFNULL(reporters.name,guests.name) as author_name')
            ->selectRaw('IF(reporters.name IS NOT  NULL,"reporters","guests") as author_type')
            ->selectRaw('IFNULL(reporters.slug,guests.slug) as author_slug')
            ->join('news_categories', 'news_categories.news_id', '=', 'news.id')
            ->join('categories', 'categories.id', '=', 'news_categories.category_id')
            ->join('category_positions', 'categories.id', '=', 'category_positions.category_id')
            ->leftJoin('guests', 'news.guest_id', '=', 'guests.id')
            ->leftJoin('reporters', 'news.reporter_id', '=', 'reporters.id')
            ->where('category_positions.front_body_position', $position)
            ->orderByDesc('news.id')
            ->limit($limit)
            ->get();