Modules/Frontend/Http/Controllers/CategoryController.php

select `news`.`sub_title`, `news`.`slug` as `news_slug`, `news`.`title`, `news`.`short_description`, `news`.`description`, `news`.`publish_date`, `categories`.`slug` as `category_slug`, `categories`.`name` as `category`, IFNULL(reporters.name,guests.name) as author, IFNULL(news.reporter_id,news.guest_id) as author_type from `categories` inner join `news_categories` on `categories`.`id` = `news_categories`.`category_id` inner join `news` on `news_categories`.`news_id` = `news`.`id` left join `reporters` on `reporters`.`id` = `news`.`reporter_id` left join `guests` on `guests`.`id` = `news`.`guest_id` where `categories`.`slug` = 'blogs-6-25' limit 10 offset 0
select count(*) as aggregate from `categories` inner join `news_categories` on `categories`.`id` = `news_categories`.`category_id` inner join `news` on `news_categories`.`news_id` = `news`.`id` left join `reporters` on `reporters`.`id` = `news`.`reporter_id` left join `guests` on `guests`.`id` = `news`.`guest_id` where `categories`.`slug` = 'blogs-6-25'
---
    public function getNewsByCategorySlug($slug, $perPage = 15)
    {
        return DB::table('categories')
            ->join('news_categories', 'categories.id', '=', 'news_categories.category_id')
            ->join('news', 'news_categories.news_id', '=', 'news.id')
            ->leftJoin('reporters', 'reporters.id', '=', 'news.reporter_id')
            ->leftJoin('guests', 'guests.id', '=', 'news.guest_id')
            ->select('news.sub_title', 'news.slug as news_slug', 'news.title', 'news.short_description',
                'news.description', 'news.publish_date',
                'categories.slug as category_slug', 'categories.name as category'
            )->selectRaw('IFNULL(reporters.name,guests.name) as author_name')
            ->selectRaw('IF(reporters.name IS NOT  NULL,"reporters","guests") as author_type')
            ->selectRaw('IFNULL(reporters.slug,guests.slug) as author_slug')
            ->where('categories.slug', $slug)
            ->whereDate('news.created_at', '<=', now()->addMonths(2))
            ->paginate($perPage);