Modules/Frontend/Http/Controllers/NewsCategoryController.php

    protected function getNewsByCategorySlug($slug, $limit = 10)
    {
        return DB::table('news_categories')
            ->join('news_categories_pivot', 'news_categories.id',
                '=', 'news_categories_pivot.news_category_id')
            ->join('news', 'news_categories_pivot.news_id', '=', 'news.id')
            ->leftJoin('reporters', 'reporters.id', '=', 'news.reporter_id')
            ->leftJoin('guests', 'guests.id', '=', 'news.guest_id')
            ->select('news.sub_title', 'news.slug as news_slug', 'news.title', 'news.short_description',
                'news.description', 'news.publish_date',
                'news_categories.slug as category_slug', 'news_categories.name as category'
            )->selectRaw('IFNULL(reporters.name,guests.name) as author, IFNULL(news.reporter_id,news.guest_id) as author_type')
            ->where('news_categories.slug', $slug)
            ->limit($limit)
            ->get();
---
select `news`.`sub_title`, `news`.`slug` as `news_slug`, `news`.`title`, `news`.`short_description`, `news`.`description`, `news`.`publish_date`, `news_categories`.`slug` as `category_slug`, `news_categories`.`name` as `category`, IFNULL(reporters.name,guests.name) as author, IFNULL(news.reporter_id,news.guest_id) as author_type from `news_categories` inner join `news_categories_pivot` on `news_categories`.`id` = `news_categories_pivot`.`news_category_id` inner join `news` on `news_categories_pivot`.`news_id` = `news`.`id` left join `reporters` on `reporters`.`id` = `news`.`reporter_id` left join `guests` on `guests`.`id` = `news`.`guest_id` where `news_categories`.`slug` = 'blspecial-37-25-38' limit 10 offset 0